def is_even(x):
    if x % 2 == 0:
        return True
    else:
        return False


number = int(input("Enter a number: "))
print(is_even(number))


def area(x, y):
    return x * y


print(area(4, 3))


# define a function fizzBuzz
# یک عدد می گیرد و
# اگر عدد بر 3 و بر 5 بخش پذیر بود،
# fizzbuzz
# را پرینت نماید
# اگر عدد بر 3 بخش پذیر بود،
# fizz
# را پرینت نماید
# اگر بر پنج بخش پذیر بود
# buzz
# را پرینت نماید


# تمرین دوم
# تابعی بنویسید که یک عدد از ورودی دریافت می نماید
# و اگر دورقم سمت راست آن عدد
# 11، 12 و یا 13
# باشد
# th
# را به آن عدد می چسباند

#  2311   =>   2311th
#  2312   =>   2312th
#  2313   =>   2313th

# اگر رقم یکان آن عدد یک باشد
# st
# را به آن می چسباند
# 21  =>  21st

# اگر رقم یکان آن دو یک باشد
# nd
# را به آن می چسباند
# 22  =>  22nd

# اگر رقم یکان آن عدد سه باشد
# rd
# را به آن می چسباند
# 23  =>  23rd

# اگر هیچکدام از حالت های بالا درست نباشد
# th را می چسباند
